____________________________________________________________________________________________________
Layer (type)                     Output Shape          Param #     Connected to                     
====================================================================================================
input_1 (InputLayer)             (None, 106, 320, 3)   0                                            
____________________________________________________________________________________________________
block1_conv1 (Convolution2D)     (None, 106, 320, 64)  0           input_1[0][0]                    
____________________________________________________________________________________________________
block1_conv2 (Convolution2D)     (None, 106, 320, 64)  0           block1_conv1[0][0]               
____________________________________________________________________________________________________
block1_pool (MaxPooling2D)       (None, 53, 160, 64)   0           block1_conv2[0][0]               
____________________________________________________________________________________________________
block2_conv1 (Convolution2D)     (None, 53, 160, 128)  0           block1_pool[0][0]                
____________________________________________________________________________________________________
block2_conv2 (Convolution2D)     (None, 53, 160, 128)  0           block2_conv1[0][0]               
____________________________________________________________________________________________________
block2_pool (MaxPooling2D)       (None, 26, 80, 128)   0           block2_conv2[0][0]               
____________________________________________________________________________________________________
block3_conv1 (Convolution2D)     (None, 26, 80, 256)   0           block2_pool[0][0]                
____________________________________________________________________________________________________
block3_conv2 (Convolution2D)     (None, 26, 80, 256)   0           block3_conv1[0][0]               
____________________________________________________________________________________________________
block3_conv3 (Convolution2D)     (None, 26, 80, 256)   0           block3_conv2[0][0]               
____________________________________________________________________________________________________
block3_pool (MaxPooling2D)       (None, 13, 40, 256)   0           block3_conv3[0][0]               
____________________________________________________________________________________________________
block4_conv1 (Convolution2D)     (None, 13, 40, 512)   0           block3_pool[0][0]                
____________________________________________________________________________________________________
block4_conv2 (Convolution2D)     (None, 13, 40, 512)   0           block4_conv1[0][0]               
____________________________________________________________________________________________________
block4_conv3 (Convolution2D)     (None, 13, 40, 512)   0           block4_conv2[0][0]               
____________________________________________________________________________________________________
block4_pool (MaxPooling2D)       (None, 6, 20, 512)    0           block4_conv3[0][0]               
____________________________________________________________________________________________________
block5_conv1 (Convolution2D)     (None, 3, 10, 512)    2359808     block4_pool[0][0]                
____________________________________________________________________________________________________
block5_conv2 (Convolution2D)     (None, 3, 5, 512)     2359808     block5_conv1[0][0]               
____________________________________________________________________________________________________
block5_conv3 (Convolution2D)     (None, 3, 3, 512)     2359808     block5_conv2[0][0]               
____________________________________________________________________________________________________
flatten_1 (Flatten)              (None, 4608)          0           block5_conv3[0][0]               
____________________________________________________________________________________________________
dropout_1 (Dropout)              (None, 4608)          0           flatten_1[0][0]                  
____________________________________________________________________________________________________
fc1 (Dense)                      (None, 2048)          9439232     dropout_1[0][0]                  
____________________________________________________________________________________________________
dropout_2 (Dropout)              (None, 2048)          0           fc1[0][0]                        
____________________________________________________________________________________________________
fc2 (Dense)                      (None, 1024)          2098176     dropout_2[0][0]                  
____________________________________________________________________________________________________
dropout_3 (Dropout)              (None, 1024)          0           fc2[0][0]                        
____________________________________________________________________________________________________
predictions (Dense)              (None, 1)             1025        dropout_3[0][0]                  
====================================================================================================
Total params: 18617857
____________________________________________________________________________________________________
Epoch 1/50
42240/42261 [============================>.] - ETA: 0s - loss: 0.0150Epoch 00000: val_loss improved from inf to 0.00614, saving model to model.h5
42261/42261 [==============================] - 346s - loss: 0.0150 - val_loss: 0.0061
Epoch 2/50
42240/42261 [============================>.] - ETA: 0s - loss: 0.0081Epoch 00001: val_loss improved from 0.00614 to 0.00534, saving model to model.h5
42261/42261 [==============================] - 339s - loss: 0.0081 - val_loss: 0.0053
Epoch 3/50
42240/42261 [============================>.] - ETA: 0s - loss: 0.0078Epoch 00002: val_loss improved from 0.00534 to 0.00503, saving model to model.h5
42261/42261 [==============================] - 336s - loss: 0.0078 - val_loss: 0.0050
Epoch 4/50
42240/42261 [============================>.] - ETA: 0s - loss: 0.0074Epoch 00003: val_loss did not improve
42261/42261 [==============================] - 345s - loss: 0.0074 - val_loss: 0.0055
Epoch 5/50
42240/42261 [============================>.] - ETA: 0s - loss: 0.0073Epoch 00004: val_loss did not improve
42261/42261 [==============================] - 344s - loss: 0.0073 - val_loss: 0.0051
Epoch 6/50
42240/42261 [============================>.] - ETA: 0s - loss: 0.0072Epoch 00005: val_loss did not improve
42261/42261 [==============================] - 343s - loss: 0.0072 - val_loss: 0.0054
Epoch 7/50
42240/42261 [============================>.] - ETA: 0s - loss: 0.0072Epoch 00006: val_loss did not improve
Epoch 00006: early stopping
42261/42261 [==============================] - 353s - loss: 0.0072 - val_loss: 0.0052
